//25 вариант Задание - Написать программу, которая бы по введенному номеру единицы измерения (1 — килограмм, 2 — миллиграмм, 3 — грамм, 4 — тонна, 5 — центнер) 
//и массе М выдавала бы соответствующее значение массы в килограммах.
#include <iostream>
#include <math.h>
using namespace std;

int main() 
{
   int x;
   float m;

   //Ввод значений
   cout << "Введите число от 1 до 5 где " << "\n1 - киллограмм, 2 - миллиграмм, 3 - грамм, 4 - тонна и 5 - центнер: ";
   cin >> x;
   cout << "Введите массу M = ";
   cin >> m;

   //Оператор с выбором и вывод по итогам выбора
   switch (x)
   {
       case 1:
       {
           cout << "Масса = " << m << " кг";
           break;
       }
       case 2:
       {
           cout << "Масса = " << m/1000000 << " кг";
           break;
       }
       case 3:
       {
           cout << "Масса = " << m/1000 << " кг";
           break;
       }
       case 4:
       {
           cout << "Масса = " << m*1000 << " кг";
           break;
       }
       case 5:
       {
           cout << "Масса = " << m*100 << " кг";
           break;
       }
       default:
       {
           cout << "Введено неверное значение";
       }
   }
    return 0;
}
